<?php
// 手動作成 基本定数ファイル
// \public\js\admin\common.js にも設定あり
return [
    'editmode' => [
        'create' => 'create',
        'edit' => 'edit',
        'destroy' => 'destroy',
    ],


    // 作業証明書 1回での取得件数マックス
    'max_get' => 1000,

    // 作業員(workers) 所属会社
    'belongs' => [
        1 => '自社',
        2 => '三浦組',
        3 => '○○組',
        4 => '××組',
        5 => '△△△△組',
        6 => '□□□□組',
    ],
    // 作業員(workers) 労働形態
    'style' => [
        1 => '正社員',
        2 => 'アルバイト',
    ],
    // 作業員(workers) 社会保険
    'insurance' => [
        1 => 'あり',
        2 => 'なし',
    ],


    // 作業証明書 工事の定数
    'KOJI' => [
        'KOJI_KASETU' => 1,
        'KOJI_CONCRETE' => 2,
        'KOJI_DOKO' => 3,
        'KOJI_JOYO1' => 4,
        'KOJI_JOYO2' => 5,
        'KOJI_KBN_LIST' => [
            'KASETSU' => 1,
            'CONCRETE' => 2,
            'DOKO' => 3,
            'OTHER' => 99,
        ],
        'KOJI_KBN_LIST_NAME' => [
            '' => '',
            1 => 'コンクリート',
            2 => '仮設',
            3 => '土工事',
            4 => 'その他',
        ],
    ],

    'KOJINAMES' => [
        1 => '仮設',
        2 => 'コンクリート',
        3 => '土工事',
        4 => '常傭工事①',
        5 => '常傭工事②',
    ],

    'TOBI_DOKO' => [
        'tobi' => '鳶工',
        'doko' => '土工',
    ],

    'TOBI_DOKO_KBN_SHORT' => [
        '' => '',
        1 => '鳶',
        2 => '土',
    ],

    'KOJI_TEIKEI' => [
        1 => [
            '仮囲い',
            '通路',
            '鉄筋足場',
            'やぐら',
            '外部足場',
            'ロングスパン',
            'ステージ',
            'タワークレーン',
            '支保工',
            '手摺',
        ],
        2 => [
            'レベルコン',
            '基礎',
            'スラブ',
            '立上り',
            'パラペット',
            'シンダー',
            '雑コン',
            'ダメ穴',
            'ベース',
            '梁',
        ],
        3 => [
            '掘削',
            '矢板',
            '簡易山留',
            '砕石敷',
            '床付',
            '釜場掘削',
            '埋戻し',
            '整地',
            'スキ取り',
            '鉄板敷',
        ],
        4 => [
            '片付・清掃',
            '水替え',
            'ピット清掃',
            'ケレン清掃',
            '足場清掃',
            '雑コンクリート',
            'シンダー打設',
            'パラペット打設',
            '捨てコン打設',
        ],
        5 => [
            '片付・清掃',
            '水替え',
            'ピット清掃',
            'ケレン清掃',
            '足場清掃',
            '雑コンクリート',
            'シンダー打設',
            'パラペット打設',
            '捨てコン打設',
        ],
    ],


    // 稼働時間 30分刻み
    'KADOTIMES' => [
        '' => '',
        '06:00:00' => '06:00',
        '06:30:00' => '06:30',
        '07:00:00' => '07:00',
        '07:30:00' => '07:30',
        '08:00:00' => '08:00',
        '08:30:00' => '08:30',
        '09:00:00' => '09:00',
        '09:30:00' => '09:30',
        '10:00:00' => '10:00',
        '10:30:00' => '10:30',
        '11:00:00' => '11:00',
        '11:30:00' => '11:30',
        '12:00:00' => '12:00',
        '12:30:00' => '12:30',
        '13:00:00' => '13:00',
        '13:30:00' => '13:30',
        '14:00:00' => '14:00',
        '14:30:00' => '14:30',
        '15:00:00' => '15:00',
        '15:30:00' => '15:30',
        '16:00:00' => '16:00',
        '16:30:00' => '16:30',
        '17:00:00' => '17:00',
        '17:30:00' => '17:30',
        '18:00:00' => '18:00',
        '18:30:00' => '18:30',
        '19:00:00' => '19:00',
        '19:30:00' => '19:30',
        '20:00:00' => '20:00',
        '20:30:00' => '20:30',
    ],

    // 早残業
    'SOZAN' => [
        ''  => '',
        '0.5' => '0.5H',
        '1'   => '1H',
        '1.5' => '1.5H',
        '2'   => '2H',
        '2.5' => '2.5H',
        '3'   => '3H',
        '3.5' => '3.5H',
        '4'   => '4H',
        '4.5' => '4.5H',
    ],


    // ポンプ
    'PUMP' => [
        '0' => '',
        '10' => '2',
        '20' => '4',
        '30' => '8',
        '40' => '10',
        '50' => '10以上',
        '999' => 'その他',
    ],

    // 重機
    'JUKI' => [
        '0' => '',
        '10' => '0.1',
        '20' => '0.25',
        '30' => '0.4',
        '40' => '0.7',
        '999' => 'その他',
    ],

    // ダンプ
    'DUMP' => [
        '0' => '',
        '10' => '2t',
        '20' => '4t',
        '30' => '7t',
        '40' => '10t',
        '999' => 'その他',
    ],

    // adminlte cardが閉じてる・開いてるのクラス・スタイル
/*
閉じてる
collapsed-card
fa-plus
display: none;


開いてる
なし
fa-minus
display: block;
*/
    'COLLAPSE' => [
        'CLOSE' => [
            'CARD_CLASS' => 'collapsed-card',
            'BTN_CLASS'  => 'fa-plus',
            'BODY_STYLE' => 'display: none;',
        ],
        'OPEN' => [
            'CARD_CLASS' => '',
            'BTN_CLASS'  => 'fa-minus',
            'BODY_STYLE' => '',
        ],
    ],
];
